In [26]:
import pandas as pd
import numpy as np

In [24]:
series = pd.Series(["하나","둘","셋","넷","다섯",
                    "여섯","일곱","여덟","아홉","열"],
                  index = [_ for _ in range(1,11)])
series

1     하나
2      둘
3      셋
4      넷
5     다섯
6     여섯
7     일곱
8     여덟
9     아홉
10     열
dtype: object

In [27]:
s = pd.Series([9_904_312,3_448_737,2_890_451,2_466_052],
              index = ["서울","부산","인천","대구"])
s

서울    9904312
부산    3448737
인천    2890451
대구    2466052
dtype: int64

In [31]:
a = pd.Series(list(range(10,100,10)))
a

0    10
1    20
2    30
3    40
4    50
5    60
6    70
7    80
8    90
dtype: int64

In [129]:
s.index

Index(['서울', '부산', '인천', '대구'], dtype='object', name='도시')

In [130]:
s.values

array([9904312, 3448737, 2890451, 2466052], dtype=int64)

In [37]:
pd.Series()

C:\Users\user\AppData\Local\Temp\ipykernel_22048\2031691219.py:1: FutureWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  pd.Series()

Series([], dtype: float64)

In [52]:
sum(a.values > 50)

4

In [53]:
aa = [i for i in a.values if i > 50]

In [54]:
cnt = 0
arr = a.values
for i in arr:
    if i>50:
        cnt +=1
print(cnt)

4

In [128]:
s.name = "인구"
s.index.name = "도시"
s

도시
서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

In [64]:
d ={'a':1,'b':2,'c':3}
ser = pd.Series(data=d, index=['c','a','b'])
ser

c    3
a    1
b    2
dtype: int64

In [66]:
a = pd.Series([88,95,100,67],['철수','영희','길동','몽룡'])
a

철수     88
영희     95
길동    100
몽룡     67
dtype: int64

In [95]:
a = pd.Series({'철수':88,'영희':95,'길동':100,'몽룡':67})
a

철수     88
영희     95
길동    100
몽룡     67
dtype: int64

In [105]:
ser.a , ser.b , ser.c

(1, 2, 3)

In [69]:
"서울" in s

True

In [109]:
"부산" in s

True

In [110]:
test = dict(zip(range(10),list("영일이삼사오육칠팔구")))

In [111]:
test.values()

dict_values(['영', '일', '이', '삼', '사', '오', '육', '칠', '팔', '구'])

In [112]:
test.keys()

dict_keys([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])

In [116]:
for k,v in test.items():
    print(k,v)

0 영
1 일
2 이
3 삼
4 사
5 오
6 육
7 칠
8 팔
9 구

In [131]:
s.values

array([9904312, 3448737, 2890451, 2466052], dtype=int64)

In [84]:
for k,v in s.items():
    if v > 3000000:
        print(f"{k}의 인구는 300만이 넘습니다.")

서울의 인구는 300만이 넘습니다.
부산의 인구는 300만이 넘습니다.

In [166]:
s/1000000

도시
서울    9.904312
부산    3.448737
인천    2.890451
대구    2.466052
Name: 인구, dtype: float64

In [167]:
s[['서울','인천','대구']]

도시
서울    9904312
인천    2890451
대구    2466052
Name: 인구, dtype: int64

In [170]:
s[['인천']]
s[[2]]

도시
인천    2890451
Name: 인구, dtype: int64

In [171]:
s[0:3]

도시
서울    9904312
부산    3448737
인천    2890451
Name: 인구, dtype: int64

In [173]:
s['부산':'대구']

도시
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

In [185]:
s2 = pd.Series({"서울":9631482,"부산":3393191,"인천":2632035,"대전":1490158})
s2

서울    9631482
부산    3393191
인천    2632035
대전    1490158
dtype: int64

In [186]:
ds  = s-s2
ds

대구         NaN
대전         NaN
부산     55546.0
서울    272830.0
인천    258416.0
dtype: float64

In [176]:
ds.isnull()

대구     True
대전     True
부산    False
서울    False
인천    False
dtype: bool

In [178]:
ds.notnull()

대구    False
대전    False
부산     True
서울     True
인천     True
dtype: bool

In [179]:
ds[ds.notnull()]

부산     55546.0
서울    272830.0
인천    258416.0
dtype: float64

In [180]:
ds[ds.isnull()]

대구   NaN
대전   NaN
dtype: float64

In [250]:
rs = (s-s2) /s2*100
rs = rs[rs.notnull()]
rs

부산    1.636984
서울    2.832690
인천    9.818107
dtype: float64

In [247]:
ds  = s-s2
ds[ds.notnull()]
ds[[ds.argmax()]]

서울    272830.0
dtype: float64

In [251]:
rs['부산'] = 1.63

In [252]:
rs

부산    1.630000
서울    2.832690
인천    9.818107
dtype: float64

In [245]:
rs[[1,2]] = [2.83,9.82]

In [256]:
rs[1:] = [2.83,9.82]
rs[[1,2]] = [2.83,9.82]
rs['서울','인천'] = [2.83,9.82]
rs['서울':'인천'] = [2.83,9.82]

In [257]:
rs

부산    1.63
서울    2.83
인천    9.82
dtype: float64

In [202]:
rs["대구"] = 1.41

In [203]:
rs

부산    1.63
서울    2.83
인천    9.82
대구    1.41
dtype: float64

In [204]:
del rs["서울"]
rs

부산    1.63
인천    9.82
대구    1.41
dtype: float64

In [212]:
fin1 = {"카카오":60010,"삼성전자":61000,"LG전자":90000}
fin2_value=[60200,61200,200100]
fin2_index = ["카카오","삼성전자","네이버"]
ser_finance1 = pd.Series(fin1)
ser_finance2 = pd.Series(fin2_value,fin2_index)
print(ser_finance1)
print(ser_finance2)

카카오     60010
삼성전자    61000
LG전자    90000
dtype: int64
카카오      60200
삼성전자     61200
네이버     200100
dtype: int64

In [213]:
ser_finance1 - ser_finance2

LG전자      NaN
네이버       NaN
삼성전자   -200.0
카카오    -190.0
dtype: float64

In [214]:
ser_finance1 + ser_finance2

LG전자         NaN
네이버          NaN
삼성전자    122200.0
카카오     120210.0
dtype: float64

In [215]:
ser_finance1 * ser_finance2

LG전자             NaN
네이버              NaN
삼성전자    3.733200e+09
카카오     3.612602e+09
dtype: float64

In [216]:
ser_finance1 / ser_finance2

LG전자         NaN
네이버          NaN
삼성전자    0.996732
카카오     0.996844
dtype: float64

In [219]:
result = ser_finance1 - ser_finance2
result[result.notnull()]

삼성전자   -200.0
카카오    -190.0
dtype: float64

In [259]:
d = {'col1' : [1,2], 'col2':[3,4]}
df = pd.DataFrame(data=d)
df

   col1  col2
0     1     3
1     2     4

In [286]:
data = {
    '2015' : [9904312, 3448737, 2890451, 2466052],
    '2010' : [9631482, 3393191, 2632035, 2431774],
    '2005' : [9762546, 3512547, 2517680, 2456016],
    '2000' : [9853972, 3655437, 2466338, 2473990],
    '지역':['수도권','경상권','수도권','경상권'],
    '2010-2015 증가율' : [0.0283,0.0163,0.0982,0.0141]
}
columns = ['지역','2015','2010','2005','2000','2010-2015 증가율']
index = ['서울','부산','인천','대구']
df = pd.DataFrame(data,index=index,columns=columns)
df

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [265]:
df.values

array([['수도권', 9904312, 9631482, 9762546, 9853972, 0.0283],
       ['경상권', 3448737, 3393191, 3512547, 3655437, 0.0163],
       ['수도권', 2890451, 2632035, 2517680, 2466338, 0.0982],
       ['경상권', 2466052, 2431774, 2456016, 2473990, 0.0141]], dtype=object)

In [266]:
df.columns

Index(['지역', '2015', '2010', '2005', '2000', '2010-2015 증가율'], dtype='object')

In [267]:
df.index

Index(['서울', '부산', '인천', '대구'], dtype='object')

In [269]:
df.index.name = '도시'
df.columns.name = '특성'
df

특성   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [270]:
df.dtypes

특성
지역                object
2015               int64
2010               int64
2005               int64
2000               int64
2010-2015 증가율    float64
dtype: object

In [281]:
data = { '팀':['포르투갈','대한민국','우루과이','가나'],
        '경기수':[3,3,3,3],
        '승':[2,1,1,1],
        '무승부':[0,1,1,0],
       '패':[1,1,1,2],
       '승점':[6,4,4,3],
       '골득실':[2,0,0,-2],
      }
columns = ['팀','경기수','승','무승부','패','승점','골득실']
index = [1,2,3,4]
df = pd.DataFrame(data,index=index,columns=columns)
df

      팀  경기수  승  무승부  패  승점  골득실
1  포르투갈    3  2    0  1   6    2
2  대한민국    3  1    1  1   4    0
3  우루과이    3  1    1  1   4    0
4    가나    3  1    0  2   3   -2

In [282]:
df.T

        1     2     3   4
팀    포르투갈  대한민국  우루과이  가나
경기수     3     3     3   3
승       2     1     1   1
무승부     0     1     1   0
패       1     1     1   2
승점      6     4     4   3
골득실     2     0     0  -2

In [287]:
df['2010-2015 증가율'] = df['2010-2015 증가율'] * 100
df

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972           2.83
부산  경상권  3448737  3393191  3512547  3655437           1.63
인천  수도권  2890451  2632035  2517680  2466338           9.82
대구  경상권  2466052  2431774  2456016  2473990           1.41

In [296]:
df['2010-2015 증가율'] = ((df['2010'] - df['2005']) / df['2005']*100).round(2)
df

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972          -1.34
부산  경상권  3448737  3393191  3512547  3655437          -3.40
인천  수도권  2890451  2632035  2517680  2466338           4.54
대구  경상권  2466052  2431774  2456016  2473990          -0.99

In [297]:
del df['2010-2015 증가율']
df

     지역     2015     2010     2005     2000
서울  수도권  9904312  9631482  9762546  9853972
부산  경상권  3448737  3393191  3512547  3655437
인천  수도권  2890451  2632035  2517680  2466338
대구  경상권  2466052  2431774  2456016  2473990

In [307]:
df["지역"]

서울    수도권
부산    경상권
인천    수도권
대구    경상권
Name: 지역, dtype: object

In [308]:
df["2010"]

서울    9631482
부산    3393191
인천    2632035
대구    2431774
Name: 2010, dtype: int64

In [309]:
df[['2010','2015']]

       2010     2015
서울  9631482  9904312
부산  3393191  3448737
인천  2632035  2890451
대구  2431774  2466052

In [310]:
df[["2010"]]

       2010
서울  9631482
부산  3393191
인천  2632035
대구  2431774

In [311]:
df[:1]

     지역     2015     2010     2005     2000
서울  수도권  9904312  9631482  9762546  9853972

In [312]:
df[:2]

     지역     2015     2010     2005     2000
서울  수도권  9904312  9631482  9762546  9853972
부산  경상권  3448737  3393191  3512547  3655437

In [313]:
df["2010"]["서울"]

9631482

In [352]:
data = {
 "국어": [80, 90, 70, 30],
 "영어": [90, 70, 60, 40],
 "수학": [90, 60, 80, 70],
}
columns = ["국어", "영어", "수학"]
index = ["춘향", "몽룡", "향단", "방자"]
df = pd.DataFrame(data, index=index, columns=columns)
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  40  70

In [316]:
df[["수학"]]

    수학
춘향  90
몽룡  60
향단  80
방자  70

In [317]:
df[["국어","영어"]]

    국어  영어
춘향  80  90
몽룡  90  70
향단  70  60
방자  30  40

In [353]:
df["평균 점수"] = ((df["국어"]+df["영어"]+df["수학"])/3).round(2)
df

    국어  영어  수학  평균 점수
춘향  80  90  90  86.67
몽룡  90  70  60  73.33
향단  70  60  80  70.00
방자  30  40  70  46.67

In [354]:
df['춘향':'춘향']

    국어  영어  수학  평균 점수
춘향  80  90  90  86.67

In [357]:
df.T["향단"]
#df.loc["향단"]

국어       70.0
영어       60.0
수학       80.0
평균 점수    70.0
Name: 향단, dtype: float64

In [344]:
np.random.seed(0)
a = np.random.randn(6,4)
columns=['A','B','C','D']
index = pd.date_range("20130226", periods=6)
pd.DataFrame(a,index,columns)

                   A         B         C         D
2013-02-26  1.764052  0.400157  0.978738  2.240893
2013-02-27  1.867558 -0.977278  0.950088 -0.151357
2013-02-28 -0.103219  0.410599  0.144044  1.454274
2013-03-01  0.761038  0.121675  0.443863  0.333674
2013-03-02  1.494079 -0.205158  0.313068 -0.854096
2013-03-03 -2.552990  0.653619  0.864436 -0.742165